#### ReinforcementRoundingManager Members

---

|  |
| --- |
| ReinforcementRoundingManager Class   Methods   Properties   See Also |

The  ReinforcementRoundingManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ReinforcementRoundingManager |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetLengthUnitTypeId | Gets the identifier of the length unit quantifying the reinforcement rounding values. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Element | The owner of the reinforcement rounding overrides. |
| Public property | IsActiveOnElement | Defines whether reinforcement rounding is activated for the particular element. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ReinforcementRoundingManager Class

Autodesk.Revit.DB.Structure Namespace